In [3]:
import pandas as pd

In [4]:
salaries = pd.read_csv('Salaries.csv')

In [5]:
# show the number of rows and columns

salaries.shape

(148654, 13)

In [6]:
# print the column names

salaries.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [7]:
# shows overall data about the dataframe, including the empty (null) cells

salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [8]:
salaries[['Benefits']].isnull()

        Benefits
0           True
1           True
2           True
3           True
4           True
...          ...
148649     False
148650      True
148651      True
148652      True
148653     False

[148654 rows x 1 columns]

In [14]:
# Find number of empty values

salaries[['Benefits']].isnull().sum()

Benefits    36163
dtype: int64

In [9]:
# filter base pay greater than $80k
# show only the employee name and job title fields
# once you do any operation -- any operation that produces a dataframe can have any other data frame operation applied to it

salaries[salaries['BasePay'] > 80000][['EmployeeName', 'JobTitle']]

             EmployeeName                                        JobTitle
0          NATHANIEL FORD  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1            GARY JIMENEZ                 CAPTAIN III (POLICE DEPARTMENT)
2          ALBERT PARDINI                 CAPTAIN III (POLICE DEPARTMENT)
4         PATRICK GARDNER    DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
5          DAVID SULLIVAN                       ASSISTANT DEPUTY CHIEF II
...                   ...                                             ...
132173    Ying Hang Zhang                                   Special Nurse
132254     Chinelo V Amah                                   Special Nurse
132324    Mariela B Badum                                   Special Nurse
132799  Judith A Boyajian                      Assistant Chief Attorney 1
133856    Mary Ann M Hauf                                   Special Nurse

[51785 rows x 2 columns]

In [10]:
# multiple conditions
# want basepay > 80k and agency is san francisco

salaries[(salaries['BasePay'] > 80000) & (salaries['Agency'] == 'San Francisco')][['EmployeeName','BasePay','Agency']]

             EmployeeName    BasePay         Agency
0          NATHANIEL FORD  167411.18  San Francisco
1            GARY JIMENEZ  155966.02  San Francisco
2          ALBERT PARDINI  212739.13  San Francisco
4         PATRICK GARDNER  134401.60  San Francisco
5          DAVID SULLIVAN  118602.00  San Francisco
...                   ...        ...            ...
132173    Ying Hang Zhang   85631.92  San Francisco
132254     Chinelo V Amah   81725.90  San Francisco
132324    Mariela B Badum   83561.44  San Francisco
132799  Judith A Boyajian   88352.39  San Francisco
133856    Mary Ann M Hauf   84481.40  San Francisco

[51785 rows x 3 columns]

In [11]:
# Categorical data

salaries['JobTitle'].value_counts()

Transit Operator                                  7036
Special Nurse                                     4389
Registered Nurse                                  3736
Public Svc Aide-Public Works                      2518
Police Officer 3                                  2421
                                                  ...
CHIEF HOUSING INSPECTOR                              1
TRAFFIC SIGNAL OPERATOR                              1
COURT COMPUTER FACILITIES COORDINATOR                1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I       1
VICTIM & WITNESS TECHNICIAN                          1
Name: JobTitle, Length: 2159, dtype: int64

In [12]:
print(type(salaries['JobTitle'].value_counts()))

#value_counts does not work on data frames

<class 'pandas.core.series.Series'>